<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
 <string>Downloads the latest version of Highfive and builds a package.</string>
 <key>Identifier</key>
 <string>com.cleavenworth.pkg.Highfive</string>
 <key>Input</key>
 <dict>
   <key>BUNDLE_ID</key>
   <string>com.highfive.prod</string>
   <key>NAME</key>
   <string>Highfive</string>
 </dict>
 <key>MinimumVersion</key>
 <string>1.0.0</string>
 <key>ParentRecipe</key>
 <string>com.cleavenworth.download.Highfive</string>
 <key>Process</key>
 <array>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>pkgdirs</key>
       <dict>
         <key>Applications</key>
         <string>0775</string>
         <key>Library</key>
         <string>0775</string>
         <key>Library/Internet Plug-Ins</key>
         <string>0775</string>
       </dict>
       <key>pkgroot</key>
       <string>%RECIPE_CACHE_DIR%/%NAME%</string>
     </dict>
     <key>Processor</key>
     <string>PkgRootCreator</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>source</key>
       <string>%RECIPE_CACHE_DIR%/expanded/nphighfive_launcher_prod.plugin</string>
       <key>target</key>
       <string>%pkgroot%/Library/Internet Plug-Ins/nphighfive_launcher_prod.plugin</string>
     </dict>
     <key>Processor</key>
     <string>FileMover</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>source</key>
       <string>%RECIPE_CACHE_DIR%/expanded/HighfiveApp.app</string>
       <key>target</key>
       <string>%pkgroot%/Applications/HighfiveApp.app</string>
     </dict>
     <key>Processor</key>
     <string>FileMover</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>input_plist_path</key>
       <string>%pkgroot%/Applications/HighfiveApp.app/Contents/Info.plist</string>
       <key>plist_version_key</key>
       <string>CFBundleVersion</string>
     </dict>
     <key>Processor</key>
     <string>Versioner</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>pkg_request</key>
       <dict>
         <key>chown</key>
         <array>
           <dict>
             <key>group</key>
             <string>admin</string>
             <key>path</key>
             <string>Library/Internet Plug-Ins/nphighfive_launcher_prod.plugin</string>
             <key>user</key>
             <string>root</string>
           </dict>
         </array>
         <key>id</key>
         <string>%BUNDLE_ID%</string>
         <key>options</key>
         <string>purge_ds_store</string>
         <key>pkgname</key>
         <string>%NAME%-%version%</string>
         <key>version</key>
         <string>%version%</string>
       </dict>
     </dict>
     <key>Processor</key>
     <string>PkgCreator</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>path_list</key>
       <array>
         <string>%RECIPE_CACHE_DIR%/expanded</string>
         <string>%RECIPE_CACHE_DIR%/%NAME%</string>
       </array>
     </dict>
     <key>Processor</key>
     <string>PathDeleter</string>
   </dict>
 </array>
</dict>
</plist>
